Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>550</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетныйПорядокРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Д_ИсточникиСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииКлиентов</v8:Type>
						<v8:Type>cfg:CatalogRef.сабКатегорииКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотенциалКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтгрузкиПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвежиеСрокиГодности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьВСмарт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияСМП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияВГОВНХ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидГосударственногоОргана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГосударственныхОрганов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодГосударственногоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналСбыта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КаналыСбытаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСети</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УУ_ПриОткрытииПосле(Отказ)
	
	ОграничениеПрав = Бюджетныйнасервере.СправочникНайтиПоНаименованию("сабМониторВнедрения", "ОграничениеПравРедактированияКлючевыхСправочников", Истина);
	
	Если ЗначениеЗаполнено(ОграничениеПрав) И БюджетныйНаСервере.ВернутьРеквизит(ОграничениеПрав, "Значение") = "Да" Тогда
		
		Если Не БюджетныйНаСервере.РольДоступнаСервер("АдминистраторСистемы") Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Группа = Элементы.Добавить(
	"УпрГруппа",
	Тип("ГруппаФормы"),
	ЭтаФорма);
	
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Поведение  = ПоведениеОбычнойГруппы.Свертываемая;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Группа.Заголовок = "Реквизиты (Управленка):";
	
	ПолеВвода = Элементы.Добавить("ПриоритетныйПорядокРасчетов", Тип("ПолеФормы"), Группа);
	ПолеВвода.Заголовок = "Приоритетный порядок расчетов";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ПриоритетныйПорядокРасчетов";
	ПолеВвода.Видимость = Не Справочники.сабМониторВнедрения.ПолучитьЗначениеНастройки("АльтернативнаяФормаЗаказов");
	
	ПолеВвода = Элементы.Добавить("СтатусКлиента", Тип("ПолеФормы"), Группа);
	ПолеВвода.Заголовок = "Статус клиента";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.СтатусКлиента"; 
	
	ПолеВвода = Элементы.Добавить("КатегорияКлиента", Тип("ПолеФормы"), Группа);
	ПолеВвода.Заголовок = "Категория клиента";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КатегорияКлиента"; 
	
	ПолеВвода = Элементы.Добавить("СкладОтгрузкиПоУмолчанию", Тип("ПолеФормы"), Группа);
	ПолеВвода.Заголовок = "Склад отгрузки по умолчанию";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.СкладОтгрузкиПоУмолчанию"; 
	
	ГруппаПотенциал = Элементы.Добавить("УпрГруппа1", Тип("ГруппаФормы"), Группа);
	ГруппаПотенциал.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	ГруппаПотенциал.Отображение = ОтображениеОбычнойГруппы.Нет;    
	ГруппаПотенциал.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаПотенциал.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВвода = Элементы.Добавить("ПотенциалКлиента", Тип("ПолеФормы"), ГруппаПотенциал);
	ПолеВвода.Заголовок = "Потенциальный объем";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.ПотенциалКлиента";  
	
	ПолеВвода = Элементы.Добавить("ТекстРуб", Тип("ДекорацияФормы"), ГруппаПотенциал);
	ПолеВвода.Заголовок = "руб";
	ПолеВвода.Вид = ВидДекорацииФормы.Надпись; 
	
	ПолеВвода = Элементы.Добавить("ТипКлиента", Тип("ПолеФормы"), Группа);
	ПолеВвода.Заголовок = "Тип клиента";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ТипКлиента"; 
	
	ПолеВвода = Элементы.Добавить("ТипЦен", Тип("ПолеФормы"), Группа);
	ПолеВвода.Заголовок = "Тип цен";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ТипЦен";
	
	ГруппаОрганизацияВГОВНХ = Элементы.Добавить(
	"УпрГруппаВтораяСтрока",
	Тип("ГруппаФормы"),
	Группа);
	ГруппаОрганизацияВГОВНХ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОрганизацияВГОВНХ.Поведение  = ПоведениеОбычнойГруппы.Обычное;
	ГруппаОрганизацияВГОВНХ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаОрганизацияВГОВНХ.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	ПолеВвода = Элементы.Добавить("ОрганизацияВГОВНХ", Тип("ПолеФормы"), ГруппаОрганизацияВГОВНХ);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПутьКДанным = "Объект.ОрганизацияВГОВНХ";
	ПолеВвода.УстановитьДействие("ПриИзменении","ОрганизацияВГОВНХПриИзменении");
	
	//ПолеВвода = Элементы.Добавить("ЭтоОрганизация", Тип("ПолеФормы"), Группа); 
	ПолеВвода = Элементы.Добавить("ЭтоОрганизация", Тип("ПолеФормы"), ГруппаОрганизацияВГОВНХ);
	//ПолеВвода.Заголовок = "Это организация";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПодсказкаВвода = "Только для ВГО (ВНХ)";
	ПолеВвода.ПутьКДанным = "Объект.ЭтоОрганизация"; 
	ПолеВвода.Доступность = Объект.ОрганизацияВГОВНХ;
	ПолеВвода.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	ПолеВвода = Элементы.Добавить("СвежиеСрокиГодности", Тип("ПолеФормы"), Группа);
	ПолеВвода.Заголовок = "Свежие сроки годности";
	ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПутьКДанным = "Объект.СвежиеСрокиГодности";
	
	ПолеВвода = Элементы.Добавить("ВыгружатьВСмарт", Тип("ПолеФормы"), Группа);
	//ПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПутьКДанным = "Объект.ВыгружатьВСмарт";
	
	ПолеВвода = Элементы.Добавить("ОрганизацияСМП", Тип("ПолеФормы"), Группа);
	//ПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПутьКДанным = "Объект.ОрганизацияСМП"; 
	
	ГруппаКаналСбытаНаименованиеСети = Элементы.Добавить(
	"ГруппаКаналСбытаНаименованиеСети",
	Тип("ГруппаФормы"),
	Группа);
	ГруппаКаналСбытаНаименованиеСети.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКаналСбытаНаименованиеСети.Поведение  = ПоведениеОбычнойГруппы.Обычное;
	ГруппаКаналСбытаНаименованиеСети.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаКаналСбытаНаименованиеСети.Отображение = ОтображениеОбычнойГруппы.Нет;

	ПолеВвода = Элементы.Добавить("КаналСбыта", Тип("ПолеФормы"), ГруппаКаналСбытаНаименованиеСети);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КаналСбыта";  
	
	ПолеВвода = Элементы.Добавить("НаименованиеСети", Тип("ПолеФормы"), ГруппаКаналСбытаНаименованиеСети);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.НаименованиеСети";


	Если Справочники.сабМониторВнедрения.ПолучитьЗначениеНастройки("ТипКатегорииКлиентаСправочник") = Истина Тогда
		Если ТипЗнч(Объект.КатегорияКлиента) = Тип("СправочникСсылка.сабКатегорииКлиентов") ИЛИ
			Объект.КатегорияКлиента = Неопределено Тогда
			Элементы.КатегорияКлиента.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.сабКатегорииКлиентов");
			Элементы.КатегорияКлиента.ВыбиратьТип = Ложь; 
		КонецЕсли;
	Иначе
		Если ТипЗнч(Объект.КатегорияКлиента) = Тип("ПеречислениеСсылка.КатегорииКлиентов") ИЛИ
			Объект.КатегорияКлиента = Неопределено Тогда
			Элементы.КатегорияКлиента.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииКлиентов");
			Элементы.КатегорияКлиента.ВыбиратьТип = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры 

//Назначен программно 
&НаКлиенте
Процедура ОрганизацияВГОВНХПриИзменении(Элемент)

	Элементы.ЭтоОрганизация.Доступность = Объект.ОрганизацияВГОВНХ;
	
КонецПроцедуры
